{
    "hcpdata":[
     {
        "desc":"Maintenance Technician at Vanderlande \\u00b7 Experience: Vanderlande \\u00b7 Location: Hemet \\u00b7 7 connections on LinkedIn. View Edgar Gonzalez's profile on LinkedIn, a professional community of 1 billion ...",
        "title":"EDGAR P GONZALEZ, NPI 1093352437 - Technician, Other in Temecula, CA"
    },
    {
        "desc":"About EDGAR GONZALEZ. Edgar Gonzalez is a provider established in Temecula, California and his medical specialization is Technician, Other.The healthcare provider is registered in the NPI registry with number 1093352437 assigned on December 2019. The practitioner's primary taxonomy code is 247200000X.The provider is registered as an individual and his NPI record was last updated 4 years ago.",
        "title":"Edgar Gonzalez Temecula CA"
    },
    {
        "desc":"Edgar Gonzalez Gonzalez, Edgar is a male health care provider in Temecula with Technician - Click to see all Technician providers in Temecula and other nearby locations listed as their primary medical specialization. Edgar Gonzalez's primary practice location is listed as: Edgar Gonzalez 31889 Calle Luz Temecula, CA 92592-3926 - Directions available below (print and phone)",
        "title":"Edgar Gonzalez \\u00b7 Family Nurse Practitioner - OpenNPI"
    },
    {
        "desc":"Edgar Gonzalez is a Family Nurse Practitioner practicing in Orlando, Florida. The National Provider Identifier (NPI) is #1407553423, which was assigned on February 9, 2023, and the registration record was last updated on January 31, 2024. ... Other Technician: 2019-12-04: Edgar V M Cruz-Gonzalez: 1100 E Dove Ave Ste 300, Mcallen, TX 78504-4672 ...",
        "title":"Edgar Gonzalez - Maintenance Technician - Vanderlande | LinkedIn"
    },
    {
        "desc":"View Edgar Gonzalez's profile on LinkedIn, the world's largest professional community. ... Control Systems Technician at JLL ... Others named Edgar Gonzalez in United States. Edgar Gonzalez",
        "title":"Edgar Gonzalez - University of California San Diego - LinkedIn"
    }
]
}